Q.1. Download the Iris Dataset and perform the following Operations.

1. Find all rows from iris data petal length(3rd column)>1.5 and sepal length(1st column)<5.0>

In [68]:
import numpy as np
import pandas as pd

df=pd.read_csv("Iris.csv")
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [69]:
data=df[(df['PetalLengthCm']>1.5) & (df["SepalLengthCm"]<5.0)]
data

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
11,12,4.8,3.4,1.6,0.2,Iris-setosa
24,25,4.8,3.4,1.9,0.2,Iris-setosa
29,30,4.7,3.2,1.6,0.2,Iris-setosa
30,31,4.8,3.1,1.6,0.2,Iris-setosa
57,58,4.9,2.4,3.3,1.0,Iris-versicolor
106,107,4.9,2.5,4.5,1.7,Iris-virginica

2. Find min,max and std deviation of sepal length

In [70]:
import numpy as np

min= np.min(data["SepalLengthCm"])
max= np.max(data["SepalLengthCm"])
std= np.std(data["SepalLengthCm"])

print(f"Minimum Sepal Length: {min}")
print(f"Maximum Sepal Length: {max}")
print(f"Standard Deviation of Sepal Length: {std}")

Minimum Sepal Length: 4.7
Maximum Sepal Length: 4.9
Standard Deviation of Sepal Length: 0.0687184270936278

3. Normalize the sepal length values so they can range exactly in 0 to 1.

In [71]:
data1= df["SepalLengthCm"]

min= np.min(data1)
max= np.max(data1)

Normalized_sepal_length = (data1 - min) / (max - min)

print(Normalized_sepal_length)

0      0.222222
1      0.166667
2      0.111111
3      0.083333
4      0.194444
         ...
145    0.666667
146    0.555556
147    0.611111
148    0.527778
149    0.444444
Name: SepalLengthCm, Length: 150, dtype: float64

4. Insert null values randomly in Petal length column.

In [72]:
# Randomly insert NaN values
position = np.random.choice(df.index, 10, replace=False)  # Randomly select 10 indices
print("Null values index:", position)
df.loc[position, "PetalLengthCm"] = np.nan  # Set NaN at the selected positions

# Find rows with missing values
null_rows = df['PetalLengthCm'].isna()
missing_data = df[null_rows]

# Print rows with missing values
print("Rows with missing values:")
print(missing_data)

Null values index: [ 24  14  81  62   5 131  48 110  85 124]
Rows with missing values:
      Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  \
5      6            5.4           3.9            NaN           0.4
14    15            5.8           4.0            NaN           0.2
24    25            4.8           3.4            NaN           0.2
48    49            5.3           3.7            NaN           0.2
62    63            6.0           2.2            NaN           1.0
81    82            5.5           2.4            NaN           1.0
85    86            6.0           3.4            NaN           1.6
110  111            6.5           3.2            NaN           2.0
124  125            6.7           3.3            NaN           2.1
131  132            7.9           3.8            NaN           2.0

             Species
5        Iris-setosa
14       Iris-setosa
24       Iris-setosa
48       Iris-setosa
62   Iris-versicolor
81   Iris-versicolor
85   Iris-versicolor
110   Iris-virginica
124   Iris-virginica
131   Iris-virginica

In [73]:
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

5. Find positions of missing values

In [74]:
missing_positions = np.where(pd.isnull(df["PetalLengthCm"]))[0]
missing_positions

array([  5,  14,  24,  48,  62,  81,  85, 110, 124, 131])

6. Write a script to drop all rows from iris that contain any null values.

In [75]:
df_cleaned = df.dropna()
df_cleaned

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

7. How to count unique values of species.

In [76]:
species_counts = df['Species'].value_counts()

print("Count of unique species:")
print(species_counts)

Count of unique species:
Species
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

8. Display number of rows per species.

In [77]:
# Display the number of rows per species
rows_per_species = df['Species'].value_counts()

# Print the result
print("Number of rows per species:")
print(rows_per_species)

Number of rows per species:
Species
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

Q.2. Create a dataframe using following details.

Rollno,Name,ContactNo.,Gender,Course_Name,Marks

1. Add 10 records

In [78]:
import pandas as pd

data={"Rollno":[1,2,3,4,5,6,7,8,9,10],
      "Name":["Chetana","Arya","Om","Parth","Prerna","Yami","Ayush","Ankush","Talat","Bhavesh"],
      "ContactNo.":[9414084278,9879850633,9790175251,9288313880,9530205723,9144665957,9124566599,9326417525,9629810371,9092590065],
      "Gender":["Female","Female","Male","Male","Female","Female","Male","Male","Female","Male"],
      "Course_Name":["CS","DS","CA","CS","CS","DS","CA","CS","DS","CS"],
      "Marks":[90,35,67,45,98,67,75,47,39,80]}
df=pd.DataFrame(data)
df

   Rollno     Name  ContactNo.  Gender Course_Name  Marks
0       1  Chetana  9414084278  Female          CS     90
1       2     Arya  9879850633  Female          DS     35
2       3       Om  9790175251    Male          CA     67
3       4    Parth  9288313880    Male          CS     45
4       5   Prerna  9530205723  Female          CS     98
5       6     Yami  9144665957  Female          DS     67
6       7    Ayush  9124566599    Male          CA     75
7       8   Ankush  9326417525    Male          CS     47
8       9    Talat  9629810371  Female          DS     39
9      10  Bhavesh  9092590065    Male          CS     80

2. Display all student names starting with letter 'A'

In [79]:
names_starting_with_A = df[df['Name'].str.startswith('A')]['Name']
print("Student names starting with 'A':")
print(names_starting_with_A)

Student names starting with 'A':
1      Arya
6     Ayush
7    Ankush
Name: Name, dtype: object

3. Display all records whose marks are greater than 50.

In [80]:
records_marks_greater_than_50 = df[df['Marks'] > 50]
print("\nRecords with marks greater than 50:")
print(records_marks_greater_than_50)

Records with marks greater than 50:
   Rollno     Name  ContactNo.  Gender Course_Name  Marks
0       1  Chetana  9414084278  Female          CS     90
2       3       Om  9790175251    Male          CA     67
4       5   Prerna  9530205723  Female          CS     98
5       6     Yami  9144665957  Female          DS     67
6       7    Ayush  9124566599    Male          CA     75
9      10  Bhavesh  9092590065    Male          CS     80

4. Display the records with specific course name.

In [81]:
specific_course_records = df[df['Course_Name'] == 'CS']
print("\nRecords with course name 'CS':")
print(specific_course_records)

Records with course name 'CS':
   Rollno     Name  ContactNo.  Gender Course_Name  Marks
0       1  Chetana  9414084278  Female          CS     90
3       4    Parth  9288313880    Male          CS     45
4       5   Prerna  9530205723  Female          CS     98
7       8   Ankush  9326417525    Male          CS     47
9      10  Bhavesh  9092590065    Male          CS     80

5. Display only male student records.

In [82]:
male_student_records = df[df['Gender'] == 'Male']
print("\nMale student records:")
print(male_student_records)

Male student records:
   Rollno     Name  ContactNo. Gender Course_Name  Marks
2       3       Om  9790175251   Male          CA     67
3       4    Parth  9288313880   Male          CS     45
6       7    Ayush  9124566599   Male          CA     75
7       8   Ankush  9326417525   Male          CS     47
9      10  Bhavesh  9092590065   Male          CS     80

6. Display all the students whose gender is "Female" and marks greater than 45.

In [83]:
female_students_marks_greater_than_45 = df[(df['Gender'] == 'Female') & (df['Marks'] > 45)]
print("\nFemale students with marks greater than 45:")
print(female_students_marks_greater_than_45)

Female students with marks greater than 45:
   Rollno     Name  ContactNo.  Gender Course_Name  Marks
0       1  Chetana  9414084278  Female          CS     90
4       5   Prerna  9530205723  Female          CS     98
5       6     Yami  9144665957  Female          DS     67

Q.3. Create a dataframe using list.

List1 is having names of employees

List 2 is having salaries of employees.

1. Display all the employees

In [84]:
import pandas as pd

# List of employee names and salaries
list1 = ["Chetana","Arya","Om","Parth","Prerna","Yami","Ayush","Ankush","Talat","Bhavesh"]
list2 = [55000, 65000, 58000, 72000, 63000, 69000, 72000, 80000, 75000, 68000]

df = pd.DataFrame({
    'Employee': list1,
    'Salary': list2
})

print("All Employees:")
df

All Employees:

  Employee  Salary
0  Chetana   55000
1     Arya   65000
2       Om   58000
3    Parth   72000
4   Prerna   63000
5     Yami   69000
6    Ayush   72000
7   Ankush   80000
8    Talat   75000
9  Bhavesh   68000

2. Clean the dataset

In [85]:
df_cleaned = df.dropna()
print("\nCleaned Dataset:")
print(df_cleaned)

Cleaned Dataset:
  Employee  Salary
0  Chetana   55000
1     Arya   65000
2       Om   58000
3    Parth   72000
4   Prerna   63000
5     Yami   69000
6    Ayush   72000
7   Ankush   80000
8    Talat   75000
9  Bhavesh   68000

3. Sort all the records on the basis of names

In [86]:
sorted_by_name = df.sort_values(by='Employee')
print("\nSorted by Employee Names:")
print(sorted_by_name)

Sorted by Employee Names:
  Employee  Salary
7   Ankush   80000
1     Arya   65000
6    Ayush   72000
9  Bhavesh   68000
0  Chetana   55000
2       Om   58000
3    Parth   72000
4   Prerna   63000
8    Talat   75000
5     Yami   69000

4. Sort all the records on the basis of salaries

In [87]:
sorted_by_salary = df.sort_values(by='Salary')
print("\nSorted by Salaries:")
print(sorted_by_salary)

Sorted by Salaries:
  Employee  Salary
0  Chetana   55000
2       Om   58000
4   Prerna   63000
1     Arya   65000
9  Bhavesh   68000
5     Yami   69000
6    Ayush   72000
3    Parth   72000
8    Talat   75000
7   Ankush   80000

5. Display the record of employee having the highest salary

In [88]:
highest_salary_employee = df[df['Salary'] == df['Salary'].max()]
print("\nEmployee with the highest salary:")
print(highest_salary_employee)

Employee with the highest salary:
  Employee  Salary
7   Ankush   80000